Revit 2024 API
Element.EvaluateAllParameterValues Method
 Evaluates all the parameters' values of the element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public IList<EvaluatedParameter> EvaluateAllParameterValues()
Visual Basic
Public Function EvaluateAllParameterValues As IList(Of EvaluatedParameter)
Visual C++
public:
IList<EvaluatedParameter^>^ EvaluateAllParameterValues()
Return Value
 List of EvaluatedParameter of the element.
See Also
Element Class
Autodesk.Revit.DB Namespace